Revit 2027 API
Rebar.IsValidCustomSpacingFormula Method
 Checks if the specified formula is valid (has a valid syntax).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidCustomSpacingFormula(
	Document document,
	string formula
)
Public Shared Function IsValidCustomSpacingFormula (
	document As Document,
	formula As String
) As Boolean
public:
static bool IsValidCustomSpacingFormula(
	Document^ document,
	String^ formula
)
static member IsValidCustomSpacingFormula :
        document : Document *
        formula : string -> bool
Parameters
document Document
 A document.
formula String
 The formula to check.
Return Value
Boolean
 Returns true if the specified formula is valid (has a valid syntax), false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace